# Flow Chart არის დიაგრამა, რომელიც აჩვენებს პროგრამის ნაბიჯებს ვიზუალურად.
# გამოიყენება ასეთი ფორმები:
#
# Start/End  -> პროგრამის დასაწყისი და დასასრული
# Input/Output  -> მონაცემების შეყვანა / გამოტანა
# Process -> მოქმედება ან გამოთვლა
# Decision  -> კითხვა „დიახ/არა“
#
# Flow chart გვიჩვენებს:
# Start -> Input -> Process -> Decision -> Output -> End
# Sequencing:
# მოქმედებები სრულდება ზედიზედ.
# მაგალითი:
# ნაბიჯი 1 -> ნაბიჯი 2 -> ნაბიჯი 3

# Selection:
# პროგრამა ირჩევს გზას პირობის მიხედვით.
# მაგალითი:
# if პირობა -> გააკეთე ეს
# else -> გააკეთე სხვა რამ

# Iteration:
# იგივე მოქმედება მეორდება რამდენჯერაც საჭიროა.
# ანუ:
# მოქმედება -> განმეორება -> განმეორება -> ... (სანამ პირობა შესრულდება)
# ცელსიუსი -> ფარენჰეიტი

# ფორმულა: F = (C * 9/5) + 32

C = float(input("შეიყვანე ტემპერატურა ცელსიუსში: "))
F = (C * 9/5) + 32
print("ფარენჰეიტში =", F)
