#print() --> ფუნქცია, რომელიც გამოიყენება იმისთვის რომ გამოვიტანოთ ჩვენი კოდის შედეგი.

#terminal არის ადგილი, სადაც შეგვიძლია ვნახოთ ჩვენო კოდის შედეგი.

#syntax - კოდის წერის სწორი წესი.

# რიცხვები არ საჭიროებენ ბრჭყალებს, მაგრამ თუ მავათავსეტ ბრჭყალებში რიცხვებს, ეგენი უკვე იქნებიან ტექსტური რიცხვები და არა ნამდვილი რიცხვები.

#comment - კომენტარი python-ში აღინიშნება # (დიეზით) და რასაც მასში დავწერთ კომპიუტერი მას ვერ აღვიქვამს. კომენტარის ნახვა და წაკითხვა შეუძლია

#ახალი სიტყვები -->

#parentheses - ფრჩხილები ()
print('gigi')
print("gigi")

print("hello it's me")

print(5)
print("5")