my_age = input("your age")

#input არის როცა კომპიუტერს მიაწოდებ ინფორმაციას

#output არის როცა კომპიუტერი მოგაწოდებს ინფორმაციას

num1 = int(input("შემოიტანე პირველი რიცხვი: "))
num2 = int(input("შემოიტანე მეორე რიცხვი: "))

print("მიმატება:", num1 + num2)
print("გამოკლება:", num1 - num2)
print("გამრავლება:", num1 * num2)
print("გაყოფა:", num1 / num2)

color = input("შენი საყვარელი ფერი: ")
animal = input("შენი საყვარელი ცხოველი: ")
place = input("შენი საყვარელი დასასვენებელი ადგილი ან ქვეყანა: ")

print("Your favorites are: Color:", color + ", Animal:", animal + ", Place:", place)

car1 = input("შემოიტანე პირველი მანქანის სახელი და მოდელი: ")
car2 = input("შემოიტანე მეორე მანქანის სახელი და მოდელი: ")
car3 = input("შემოიტანე მესამე მანქანის სახელი და მოდელი: ")
car4 = input("შემოიტანე მეოთხე მანქანის სახელი და მოდელი: ")

print("ყველაზე მეტად მომწონს:", car2)
print("სხვა მანქანები:", car1 + ",", car3 + ",", car4)
