# 2) ფუნქცია არის კოდის ბლოკი, რომელსაც აქვს სახელი
# ფუნქცია გამოიყენება იმისთვის, რომ ერთი და იგივე მოქმედება
# მრავალჯერ შევასრულოთ კოდის გამეორების გარეშე


# 3) print() არის ჩაშენებული (built-in) ფუნქცია
# print() ფუნქცია გამოიყენება ეკრანზე ინფორმაციის გამოსატანად
# იგი იღებს არგუმენტს და აჩვენებს მას ტერმინალში


# 4) არგუმენტები არის ის მნიშვნელობები,
# რომლებსაც ფუნქციას გადავცემთ ფრჩხილებში
# მაგალითად print("Hello") — აქ "Hello" არის არგუმენტი


# 5) f-string-ის გამოყენებით დიდი წინადადება (CV სტილში)

name = "Gigi"
age = 13
profession = "Tuff Developer"
skills = "Python, HTML, CSS"
goal = "გავხდე ძლიერი პროგრამისტი"

cv = f"გამარჯობა, მე ვარ {name}, ვარ {age} წლის და ვმუშაობ როგორც {profession}. ჩემი ძირითადი უნარებია: {skills}. ჩემი მთავარი მიზანია {goal}."

print(cv)
