# სია (List) არის მონაცემთა სტრუქტურა,
# რომელიც ინახავს რამდენიმე მნიშვნელობას ერთ ცვლადში.
# სია იწერება კვადრატულ ფრჩხილებში []

my_list = [1, 2, 3, 4, 5]  # ეს არის რიცხვების სია

# ინდექსი არის ელემენტის მდებარეობა სიაში
# ინდექსები იწყება 0-დან და არა 1-დან

fruits = ["ვაშლი", "მსხალი", "ბანანი"]

# "ვაშლი" -> ინდექსი 0
# "მსხალი" -> ინდექსი 1
# "ბანანი" -> ინდექსი 2

names = ["ანა", "ნიკა", "გიორგი", "მარი", "დათო", "საბა", "ლუკა"]

# 1-ლი ინდექსის შეცვლა (მეორე ელემენტი)
names[1] = "თამარი"

# 5-ე ინდექსის შეცვლა (მეექვსე ელემენტი)
names[5] = "ირაკლი"

print(names)

data = ["ტექსტი", 25, 3.14, True, "პითონი", 100]

# მე-2 ელემენტი (ინდექსი 1)
print(data[1])

# მე-4 ელემენტი (ინდექსი 3)
print(data[3])

# მე-6 ელემენტი (ინდექსი 5)
print(data[5])

# ელემენტებს ვიღებთ ინდექსის მეშვეობით: სია[ინდექსი]

# ცვლადი ინახავს მხოლოდ ერთ მნიშვნელობას
age = 18

# სია ინახავს რამდენიმე მნიშვნელობას ერთ ცვლადში
ages = [15, 18, 20, 22]

# ანუ:
# ცვლადი -> ერთი მონაცემი
# სია -> მრავალი მონაცემი ერთდროულად
