cars = ["BMW", "Mercedes", "Audi", "Toyota", "Honda"]

# პირველი ელემენტი (ინდექსი 0)
print(cars[0])

# მესამე ელემენტი (ინდექსი 2)
print(cars[2])

numbers = [0, 2, 4, 6, 8, 10]

# მეორე ელემენტი (ინდექსი 1)
print(numbers[1])

# მეოთხე ელემენტი (ინდექსი 3)
print(numbers[3])

colors = ["წითელი", "ლურჯი", "მწვანე", "ყვითელი", "შავი"]

# მე-4 ელემენტი (ინდექსი 3)
print(colors[3])

# მე-3 ინდექსი ნიშნავს მეოთხე ელემენტს
colors[3] = "იისფერი"

print(colors)

nums = [5, 10, 15]

# პირველი ელემენტი -> nums[0]
# ბოლო ელემენტი -> nums[2]
sum_result = nums[0] + nums[2]

print(sum_result)

names = ["ანა", "ნიკა", "გიორგი", "მარი", "დათო", "საბა", "ლუკა"]

# 1-ლი ინდექსი (მეორე ელემენტი)
names[1] = "თამარი"

# 5-ე ინდექსი (მეექვსე ელემენტი)
names[5] = "ირაკლი"

print(names)
