print("gigi")
print(5)
print("5")
#data type = მონაცემთა ტიპები

# string - არის ნებისმიერი მნიშვნელობა, რომელიც იქნება მოთავსებული " " - ბრჭყალების შორის.
print("davit")
print("group 84")

# integer - არის ნებისლიერი მთელი რიცხვი პითონში 
print(100)
print(84)

# float - არის ნებისმიერი ათწილადი რიცხვი python-ში
print(10.2)
print(84.4)



# 

print(10.2)


#ცვლადის შექმნის წესები 

# 1) ცვლადს აუცილებლად ვუფიქრებთ დასახელებას
# 2)ცვლადის დასახელების შემდეგ აუცილებლად ვწერტ = ნიშანს
# 3)ტოლობის შემდეგ ვანიჭებთ ვცლადს მნიშვნელობას.

name = "davit"
doeg = print
doeg(nagar)