# 6) ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი

# num = 1
# while num <= 30:
#   print(str(num) + " ვაშლი")
#   num += 1

# print('----------------------------------------')

# for i in range(1, 31):
#   print(str(i) + " ვაშლი")


# 7) მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop

# for i in range(13):
#   user_inp = input('Enter input: ')

# 8) გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

# num = 1
# while num < 11:
#   print('Giorgi ' + str(num))
#   num += 1

age = int(input('Enter your age: '))

if age >= 18:
  print('შენ ხარ სრულწლოვანი')
elif age > 13:
  print('შენ ხარ მოზარდი')
elif age > 6:
  print('შენ ხარ ჩვილი')


# if | თუ 
# elif | სხვა შემთხვევაში
# else | საბოლოოდ

# else არის საბოლოო გზა და სრულდება იმ შემთხვევაში თუ წინა პირობა არ სრულდება ანუ არის მცდარი.